tests/spongeLayer/system/setFieldsABLDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          setFieldsABLDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


// Extents of the domain.
xMin                      $xMin;
yMin                      $yMin;
zMin                      $zMin;

xMax                      $xMax;
yMax                      $yMax;
zMax                      $zMax;

zRef                      $zMax;

// Specify if distance from wall should be used as z.
useWallDistZ              true;
scaleVelocityWithHeight   false;


// Specify how to initialze the base velocity and temperature profile.
velocityInitType          "table";
//velocityInitType          "log";
//velocityInitType          "scaleGiven";
//velocityInitType          "geostrophic";

temperatureInitType     "table";
//temperatureInitType     "none";
//temperatureInitType       "simple";

// Maximum perturbation of streamwise/spanwise flow near surface.
deltaU                    0.25;
deltaV                    0.25;

// Total periods of perturbations in streamwise/spanwise in the domain.
Uperiods                  12.0;
Vperiods                  12.0;

// Percentage of domain height (zMax) where peak in perturbation 
// magnitude occurs.
zPeak                     0.015;

// Initial height of the center of the capping inversion.
zInversion                $zInversion;

// Width of the capping inversion.
widthInversion            $inversionWidth;

// Potential temperature at the bottom and top of the capping inversion.
Tbottom                   $TBottom;
Ttop                      $TTop;

// Maximum temperature fluctuation size below capping inversion.
TPrimeScale               0.0;

// Height rate of change of potential temperature above the inversion.
dTdz                      $TGradUpper;

// Geostrophic wind speed magnitude.
Ug                        $windSpeed;

// Geostrophic wind speed direction.
UgDir                     $windDir;

// Aerodynamic roughness height of surface.
z0                        $z0;

// von Karman constant.
kappa                     $kappa;

// Vertical profile table.
profileTable
(
//   z          U       V        T
      (0.0     2        2     300)
      (150     30       10     300)
      (1000    102      102     300)
//     (0.0 0.0 0.0 273.121917725)
//     (5.0 1.82671529027 1.98969371553 282.524156211)
//     (10.0 2.52983624172 2.77228242751 283.156504284)
//     (15.0 3.01282071998 3.35521702288 283.64108812)
//     (20.0 3.35996148006 3.78823607698 284.090761147)
//     (25.0 3.8038057643 4.37960852586 284.554077196)
//     (30.0 4.03596125279 4.70538923119 284.966777157)
//     (35.0 4.38133296535 5.23253766126 285.360167677)
//     (40.0 4.56992779673 5.53523659867 285.747101612)
//     (45.0 4.80994398595 5.96180841679 286.095879197)
//     (50.0 5.00816921409 6.32774876853 286.444585293)
//     (55.0 5.14154903327 6.60160807137 286.787914506)
//     (60.0 5.36818530188 7.08896005703 287.063199891)
//     (65.0 5.44703987742 7.27484159809 287.379906732)
//     (70.0 5.57604433164 7.60608624795 287.638417176)
//     (75.0 5.72370142776 7.99632935101 287.863981004)
//     (80.0 5.77619905069 8.15139018101 288.127106742)
//     (85.0 5.87149793296 8.46369430537 288.331005696)
//     (90.0 5.98111916718 8.83268873958 288.509035882)
//     (95.0 6.01697152506 8.97407895539 288.724664101)
//     (100.0 6.06967854005 9.19927028309 288.909565287)
//     (105.0 6.1450628792 9.53721293929 289.053124377)
//     (110.0 6.19167607924 9.76288104253 289.198531813)
//     (115.0 6.22489630605 9.93628531022 289.344799656)
//     (120.0 6.27421288656 10.216282683 289.462005)
//     (125.0 6.32645248876 10.5156368594 289.57393273)
//     (130.0 6.34668810144 10.6457361726 289.712125634)
//     (135.0 6.36434613795 10.762203832 289.852433913)
//     (140.0 6.39842793739 11.0196195883 289.95191863)
//     (145.0 6.4342454375 11.2919310606 290.047089019)
//     (150.0 6.45180421766 11.4367005351 290.150649381)
//     (155.0 6.46406875681 11.544488333 290.256642472)
//     (160.0 6.48170756073 11.7056278368 290.348224267)
//     (165.0 6.50382814701 11.9112591447 290.427787992)
//     (170.0 6.52550956366 12.1127414485 290.506470121)
//     (175.0 6.54550549533 12.298300329 290.581768788)
//     (180.0 6.56550142701 12.4838592096 290.657067454)
//     (185.0 6.58511534034 12.6567515091 290.735008491)
//     (190.0 6.6045979288 12.8252894701 290.813857884)
//     (195.0 6.62432001649 12.9896812983 290.892328604)
//     (200.0 6.64532587961 13.1318488244 290.968769537)
//     (205.0 6.66633174272 13.2740163505 291.045210471)
//     (210.0 6.69104111181 13.4098514016 291.117435921)
//     (215.0 6.72036475996 13.5377966838 291.184409209)
//     (220.0 6.74968840812 13.6657419659 291.251382497)
//     (225.0 6.77805691412 13.7640369251 291.318657013)
//     (230.0 6.80578882059 13.8425700289 291.386132296)
//     (235.0 6.83352072706 13.9211031327 291.453607578)
//     (240.0 6.86307156947 13.9862481909 291.518273832)
//     (245.0 6.89380511232 14.0426881336 291.581113612)
//     (250.0 6.92453865516 14.0991280764 291.643953391)
//     (255.0 6.95361693104 14.1462680315 291.704700258)
//     (260.0 6.98077095142 14.1825967081 291.763014104)
//     (265.0 7.0079249718 14.2189253847 291.82132795)
//     (270.0 7.03507703408 14.2541299666 291.879606535)
//     (275.0 7.0622194383 14.283790106 291.937711201)
//     (280.0 7.08936184253 14.3134502454 291.995815867)
//     (285.0 7.11650424675 14.3431103848 292.053920533)
//     (290.0 7.1430391081 14.369131837 292.11328027)
//     (295.0 7.16932392788 14.3936557439 292.173156546)
//     (300.0 7.19560874767 14.4181796507 292.233032822)
//     (305.0 7.22180906756 14.4424461024 292.292838021)
//     (310.0 7.24680913749 14.4630556198 292.351633627)
//     (315.0 7.27180920741 14.4836651372 292.410429232)
//     (320.0 7.29680927734 14.5042746546 292.469224837)
//     (325.0 7.32153609499 14.5243042572 292.528664796)
//     (330.0 7.34543057757 14.5425674214 292.590067475)
//     (335.0 7.36932506015 14.5608305855 292.651470155)
//     (340.0 7.39321954273 14.5790937496 292.712872834)
//     (345.0 7.41696733387 14.597025575 292.773542958)
//     (350.0 7.44026003553 14.6139294685 292.831940429)
//     (355.0 7.46355273718 14.6308333621 292.890337899)
//     (360.0 7.48684543884 14.6477372556 292.94873537)
//     (365.0 7.51013186129 14.6646271523 293.007149353)
//     (370.0 7.53322339247 14.68108262 293.066075821)
//     (375.0 7.55631492366 14.6975380877 293.12500229)
//     (380.0 7.57940645484 14.7139935554 293.183928758)
//     (385.0 7.60249798603 14.7304490231 293.242855226)
//     (390.0 7.6257582057 14.7463924565 293.301506178)
//     (395.0 7.64912373233 14.7620162427 293.359985132)
//     (400.0 7.67248925896 14.7776400289 293.418464087)
//     (405.0 7.69585478559 14.7932638151 293.476943042)
//     (410.0 7.71922031222 14.8088876013 293.535421996)
//     (415.0 7.74300228036 14.8230663689 293.592791002)
//     (420.0 7.7667927399 14.8372156721 293.650137374)
//     (425.0 7.79058319945 14.8513649753 293.707483747)
//     (430.0 7.81437365899 14.8655142784 293.76483012)
//     (435.0 7.83815083397 14.8793492717 293.821767406)
//     (440.0 7.86181714661 14.8905612872 293.875290779)
//     (445.0 7.88548345926 14.9017733027 293.928814153)
//     (450.0 7.9091497719 14.9129853182 293.982337526)
//     (455.0 7.93281608455 14.9241973336 294.035860899)
//     (460.0 7.95648239719 14.9354093491 294.089384273)
//     (465.0 7.97905964048 14.9423301431 294.14128451)
//     (470.0 8.0016312311 14.9492286641 294.193176323)
//     (475.0 8.02420282171 14.956127185 294.245068135)
//     (480.0 8.04677441233 14.9630257059 294.296959948)
//     (485.0 8.06934600294 14.9699242269 294.34885176)
//     (490.0 8.0912068028 14.9742300558 294.40025773)
//     (495.0 8.11235909886 14.9759515346 294.45117942)
//     (500.0 8.13351139492 14.9776730134 294.502101111)
//     (505.0 8.15466369098 14.9793944922 294.553022801)
//     (510.0 8.17581598704 14.981115971 294.603944491)
//     (515.0 8.19696828309 14.9828374498 294.654866181)
//     (520.0 8.21724149816 14.9808198644 294.704354156)
//     (525.0 8.2364694612 14.9743564264 294.752137402)
//     (530.0 8.25569742424 14.9678929884 294.799920649)
//     (535.0 8.27492538727 14.9614295505 294.847703896)
//     (540.0 8.29415335031 14.9549661125 294.895487143)
//     (545.0 8.31338131334 14.9485026745 294.943270389)
//     (550.0 8.33260927638 14.9420392365 294.991053636)
//     (555.0 8.35050488468 14.9266129312 295.036341098)
//     (560.0 8.36808840645 14.9090871924 295.081043956)
//     (565.0 8.38567192822 14.8915614535 295.125746813)
//     (570.0 8.40325544999 14.8740357147 295.170449671)
//     (575.0 8.42083897176 14.8565099758 295.215152528)
//     (580.0 8.43842249352 14.838984237 295.259855386)
//     (585.0 8.45600601529 14.8214584982 295.304558243)
//     (590.0 8.47264685758 14.7968218302 295.348171206)
//     (595.0 8.48834031368 14.765038729 295.390688832)
//     (600.0 8.50403376979 14.7332556278 295.433206459)
//     (605.0 8.51972722589 14.7014725265 295.475724085)
//     (610.0 8.53542068199 14.6696894253 295.518241712)
//     (615.0 8.55111413809 14.6379063241 295.560759338)
//     (620.0 8.56680759419 14.6061232229 295.603276965)
//     (625.0 8.5825010503 14.5743401216 295.645794591)
//     (630.0 8.59715715424 14.5346556613 295.689519112)
//     (635.0 8.61058749747 14.4856347615 295.734669729)
//     (640.0 8.62401784069 14.4366138617 295.779820347)
//     (645.0 8.63744818391 14.3875929619 295.824970964)
//     (650.0 8.65087852713 14.338572062 295.870121581)
//     (655.0 8.66430887036 14.2895511622 295.915272198)
//     (660.0 8.67773921358 14.2405302624 295.960422815)
//     (665.0 8.6911695568 14.1915093626 296.005573433)
//     (670.0 8.70459990003 14.1424884628 296.05072405)
//     (675.0 8.71498597608 14.0837507537 296.096336227)
//     (680.0 8.72352399234 14.0191143362 296.142228601)
//     (685.0 8.7320620086 13.9544779188 296.188120975)
//     (690.0 8.74060002486 13.8898415013 296.234013348)
//     (695.0 8.74913804112 13.8252050838 296.279905722)
//     (700.0 8.75767605739 13.7605686663 296.325798096)
//     (705.0 8.76621407365 13.6959322489 296.371690469)
//     (710.0 8.77475208991 13.6312958314 296.417582843)
//     (715.0 8.78329010617 13.5666594139 296.463475217)
//     (720.0 8.79182812243 13.5020229965 296.50936759)
//     (725.0 8.79189547444 13.4277463368 296.562527014)
//     (730.0 8.79098910472 13.3523615098 296.616521801)
//     (735.0 8.79008273499 13.2769766828 296.670516587)
//     (740.0 8.78917636527 13.2015918559 296.724511374)
//     (745.0 8.78826999555 13.1262070289 296.778506161)
//     (750.0 8.78736362582 13.0508222019 296.832500948)
//     (755.0 8.7864572561 12.9754373749 296.886495735)
//     (760.0 8.78555088638 12.9000525479 296.940490522)
//     (765.0 8.78464451665 12.824667721 296.994485308)
//     (770.0 8.78373814693 12.749282894 297.048480095)
//     (775.0 8.78092431283 12.6731698157 297.101321687)
//     (780.0 8.77050848097 12.594154369 297.149567342)
//     (785.0 8.76009264911 12.5151389222 297.197812997)
//     (790.0 8.74967681725 12.4361234755 297.246058652)
//     (795.0 8.73926098539 12.3571080288 297.294304307)
//     (800.0 8.72884515353 12.278092582 297.342549962)
//     (805.0 8.71842932167 12.1990771353 297.390795617)
//     (810.0 8.70801348981 12.1200616885 297.439041272)
//     (815.0 8.69759765795 12.0410462418 297.487286927)
//     (820.0 8.68718182609 11.9620307951 297.535532582)
//     (825.0 8.67676599423 11.8830153483 297.583778237)
//     (830.0 8.66635016237 11.8039999016 297.632023892)
//     (835.0 8.65380285705 11.7267327361 297.688031136)
//     (840.0 8.63847548104 11.6517458454 297.754161782)
//     (845.0 8.62314810503 11.5767589547 297.820292429)
//     (850.0 8.60782072902 11.5017720641 297.886423076)
//     (855.0 8.59249335301 11.4267851734 297.952553722)
//     (860.0 8.57716597701 11.3517982828 298.018684369)
//     (865.0 8.561838601 11.2768113921 298.084815016)
//     (870.0 8.54651122499 11.2018245015 298.150945663)
//     (875.0 8.53118384898 11.1268376108 298.217076309)
//     (880.0 8.51585647297 11.0518507201 298.283206956)
//     (885.0 8.50052909696 10.9768638295 298.349337603)
//     (890.0 8.48520172096 10.9018769388 298.41546825)
//     (895.0 8.46987434495 10.8268900482 298.481598896)
//     (900.0 8.45883220551 10.7541011047 298.547345535)
//     (905.0 8.45238242046 10.6836676328 298.612680644)
//     (910.0 8.44593263542 10.6132341608 298.678015753)
//     (915.0 8.43948285037 10.5428006888 298.743350863)
//     (920.0 8.43303306533 10.4723672168 298.808685972)
//     (925.0 8.42658328028 10.4019337449 298.874021081)
//     (930.0 8.42013349524 10.3315002729 298.93935619)
//     (935.0 8.41368371019 10.2610668009 299.004691299)
//     (940.0 8.40723392515 10.190633329 299.070026409)
//     (945.0 8.4007841401 10.120199857 299.135361518)
//     (950.0 8.39433435506 10.049766385 299.200696627)
//     (955.0 8.38788457001 9.97933291304 299.266031736)
//     (960.0 8.38143478497 9.90889944107 299.331366845)
//     (965.0 8.37498499992 9.8384659691 299.396701955)
//     (970.0 8.37175628862 9.76984547069 299.458148741)
//     (975.0 8.3787220489 9.70696290595 299.507289259)
//     (980.0 8.38568780918 9.64408034121 299.556429777)
//     (985.0 8.39265356946 9.58119777647 299.605570296)
//     (990.0 8.39961932974 9.51831521173 299.654710814)
//     (995.0 8.40658509002 9.45543264699 299.703851332)
//     (1000.0 8.4135508503 9.39255008225 299.752991851)
//     (1005.0 8.42051661058 9.32966751751 299.802132369)
//     (1010.0 8.42748237086 9.26678495277 299.851272887)
//     (1015.0 8.43444813113 9.20390238803 299.900413405)
//     (1020.0 8.44141389141 9.14101982329 299.949553924)
//     (1025.0 8.44837965169 9.07813725854 299.998694442)
//     (1030.0 8.45534541197 9.0152546938 300.04783496)
//     (1035.0 8.46231117225 8.95237212906 300.096975478)
//     (1040.0 8.46927693253 8.88948956432 300.146115997)
//     (1045.0 8.47624269281 8.82660699958 300.195256515)
//     (1050.0 8.48495783258 8.77319458603 300.238852282)
//     (1055.0 8.49495774699 8.72673721576 300.278375887)
//     (1060.0 8.5049576614 8.6802798455 300.317899492)
//     (1065.0 8.51495757581 8.63382247523 300.357423097)
//     (1070.0 8.52495749023 8.58736510496 300.396946702)
//     (1075.0 8.53495740464 8.5409077347 300.436470307)
//     (1080.0 8.54495731905 8.49445036443 300.475993912)
//     (1085.0 8.55495723346 8.44799299416 300.515517517)
//     (1090.0 8.56495714787 8.4015356239 300.555041122)
//     (1095.0 8.57495706228 8.35507825363 300.594564727)
//     (1100.0 8.58495697669 8.30862088336 300.634088332)
//     (1105.0 8.5949568911 8.2621635131 300.673611937)
//     (1110.0 8.60495680552 8.21570614283 300.713135542)
//     (1115.0 8.61495671993 8.16924877256 300.752659147)
//     (1120.0 8.62495663434 8.1227914023 300.792182752)
//     (1125.0 8.63495654875 8.07633403203 300.831706357)
//     (1130.0 8.64495646316 8.02987666176 300.871229962)
//     (1135.0 8.65360052964 7.98996489564 300.907704255)
//     (1140.0 8.65972902324 7.96219751809 300.938521005)
//     (1145.0 8.66585751685 7.93443014055 300.969337756)
//     (1150.0 8.67198601045 7.906662763 301.000154506)
//     (1155.0 8.67811450406 7.87889538546 301.030971256)
//     (1160.0 8.68424299766 7.85112800791 301.061788006)
//     (1165.0 8.69037149126 7.82336063037 301.092604757)
//     (1170.0 8.69649998487 7.79559325282 301.123421507)
//     (1175.0 8.70262847847 7.76782587527 301.154238257)
//     (1180.0 8.70875697208 7.74005849773 301.185055007)
//     (1185.0 8.71488546568 7.71229112018 301.215871758)
//     (1190.0 8.72101395929 7.68452374264 301.246688508)
//     (1195.0 8.72714245289 7.65675636509 301.277505258)
//     (1200.0 8.7332709465 7.62898898755 301.308322009)
//     (1205.0 8.7393994401 7.60122161 301.339138759)
//     (1210.0 8.74552793371 7.57345423246 301.369955509)
//     (1215.0 8.75165642731 7.54568685491 301.400772259)
//     (1220.0 8.75778492092 7.51791947737 301.43158901)
//     (1225.0 8.76391341452 7.49015209982 301.46240576)
//     (1230.0 8.76818252215 7.46990516883 301.489568668)
//     (1235.0 8.76988179508 7.46005215541 301.511681645)
//     (1240.0 8.771581068 7.45019914198 301.533794623)
//     (1245.0 8.77328034093 7.44034612856 301.5559076)
//     (1250.0 8.77497961385 7.43049311513 301.578020578)
//     (1255.0 8.77667888677 7.42064010171 301.600133555)
//     (1260.0 8.7783781597 7.41078708828 301.622246532)
//     (1265.0 8.78007743262 7.40093407485 301.64435951)
//     (1270.0 8.78177670555 7.39108106143 301.666472487)
//     (1275.0 8.78347597847 7.381228048 301.688585464)
//     (1280.0 8.7851752514 7.37137503458 301.710698442)
//     (1285.0 8.78687452432 7.36152202115 301.732811419)
//     (1290.0 8.78857379725 7.35166900773 301.754924397)
//     (1295.0 8.79027307017 7.3418159943 301.777037374)
//     (1300.0 8.7919723431 7.33196298088 301.799150351)
//     (1305.0 8.79367161602 7.32210996745 301.821263329)
//     (1310.0 8.79537088895 7.31225695402 301.843376306)
//     (1315.0 8.79707016187 7.3024039406 301.865489283)
//     (1320.0 8.79876943479 7.29255092717 301.887602261)
//     (1325.0 8.80046870772 7.28269791375 301.909715238)
//     (1330.0 8.80216798064 7.27284490032 301.931828216)
//     (1335.0 8.80345002487 7.27037429336 301.950702634)
//     (1340.0 8.80449597234 7.27208116099 301.967744453)
//     (1345.0 8.8055419198 7.27378802862 301.984786271)
//     (1350.0 8.80658786727 7.27549489624 302.00182809)
//     (1355.0 8.80763381473 7.27720176387 302.018869908)
//     (1360.0 8.8086797622 7.2789086315 302.035911727)
//     (1365.0 8.80972570966 7.28061549913 302.052953545)
//     (1370.0 8.81077165713 7.28232236676 302.069995364)
//     (1375.0 8.81181760459 7.28402923439 302.087037182)
//     (1380.0 8.81286355206 7.28573610202 302.104079001)
//     (1385.0 8.81390949952 7.28744296965 302.121120819)
//     (1390.0 8.81495544699 7.28914983727 302.138162638)
//     (1395.0 8.81600139445 7.2908567049 302.155204456)
//     (1400.0 8.81704734192 7.29256357253 302.172246275)
//     (1405.0 8.81809328938 7.29427044016 302.189288094)
//     (1410.0 8.81913923685 7.29597730779 302.206329912)
//     (1415.0 8.82018518431 7.29768417542 302.223371731)
//     (1420.0 8.82123113178 7.29939104305 302.240413549)
//     (1425.0 8.82227707924 7.30109791068 302.257455368)
//     (1430.0 8.82332302671 7.30280477831 302.274497186)
//     (1435.0 8.82436897417 7.30451164593 302.291539005)
//     (1440.0 8.82541492164 7.30621851356 302.308580823)
//     (1445.0 8.8264608691 7.30792538119 302.325622642)
//     (1450.0 8.82980499965 7.31411337437 302.342200633)
//     (1455.0 8.83363827328 7.32125512601 302.358679903)
//     (1460.0 8.83747154691 7.32839687764 302.375159173)
//     (1465.0 8.84130482054 7.33553862927 302.391638443)
//     (1470.0 8.84513809417 7.34268038091 302.408117713)
//     (1475.0 8.8489713678 7.34982213254 302.424596984)
//     (1480.0 8.85280464143 7.35696388418 302.441076254)
//     (1485.0 8.85663791506 7.36410563581 302.457555524)
//     (1490.0 8.86047118869 7.37124738745 302.474034794)
//     (1495.0 8.86430446231 7.37838913908 302.490514064)
//     (1500.0 8.86813773594 7.38553089071 302.506993334)
//     (1505.0 8.87197100957 7.39267264235 302.523472605)
//     (1510.0 8.8758042832 7.39981439398 302.539951875)
//     (1515.0 8.87963755683 7.40695614562 302.556431145)
//     (1520.0 8.88347083046 7.41409789725 302.572910415)
//     (1525.0 8.88730410409 7.42123964888 302.589389685)
//     (1530.0 8.89113737772 7.42838140052 302.605868955)
//     (1535.0 8.89497065135 7.43552315215 302.622348226)
//     (1540.0 8.89880392498 7.44266490379 302.638827496)
//     (1545.0 8.90263719861 7.44980665542 302.655306766)
//     (1550.0 8.90647047224 7.45694840705 302.671786036)
//     (1555.0 8.91030374586 7.46409015869 302.688265306)
//     (1560.0 8.91413701949 7.47123191032 302.704744577)
//     (1565.0 8.91797029312 7.47837366196 302.721223847)
//     (1570.0 8.92180356675 7.48551541359 302.737703117)
//     (1575.0 8.92995697971 7.48958529161 302.756743245)
//     (1580.0 8.93926578965 7.49283361431 302.77646826)
//     (1585.0 8.94857459959 7.496081937 302.796193275)
//     (1590.0 8.95788340953 7.49933025969 302.81591829)
//     (1595.0 8.96719221947 7.50257858238 302.835643305)
//     (1600.0 8.97650102941 7.50582690508 302.85536832)
//     (1605.0 8.98580983935 7.50907522777 302.875093335)
//     (1610.0 8.9951186493 7.51232355046 302.89481835)
//     (1615.0 9.00442745924 7.51557187315 302.914543365)
//     (1620.0 9.01373626918 7.51882019585 302.93426838)
//     (1625.0 9.02304507912 7.52206851854 302.953993395)
//     (1630.0 9.03235388906 7.52531684123 302.973718411)
//     (1635.0 9.041662699 7.52856516392 302.993443426)
//     (1640.0 9.05097150894 7.53181348662 303.013168441)
//     (1645.0 9.06028031888 7.53506180931 303.032893456)
//     (1650.0 9.06958912882 7.538310132 303.052618471)
//     (1655.0 9.07889793876 7.5415584547 303.072343486)
//     (1660.0 9.0882067487 7.54480677739 303.092068501)
//     (1665.0 9.09751555864 7.54805510008 303.111793516)
//     (1670.0 9.10682436858 7.55130342277 303.131518531)
//     (1675.0 9.11613317852 7.55455174547 303.151243546)
//     (1680.0 9.12544198846 7.55780006816 303.170968561)
//     (1685.0 9.1347507984 7.56104839085 303.190693576)
//     (1690.0 9.14405960834 7.56429671354 303.210418591)
//     (1695.0 9.15336841829 7.56754503624 303.230143606)
//     (1700.0 9.16267722823 7.57079335893 303.249868621)
//     (1705.0 9.17198603817 7.57404168162 303.269593636)
//     (1710.0 9.18349377603 7.57239347669 303.290540127)
//     (1715.0 9.19922226437 7.56134659115 303.31383119)
//     (1720.0 9.2149507527 7.55029970561 303.337122252)
//     (1725.0 9.23067924103 7.53925282007 303.360413315)
//     (1730.0 9.24640772936 7.52820593453 303.383704377)
//     (1735.0 9.2621362177 7.51715904899 303.40699544)
//     (1740.0 9.27786470603 7.50611216345 303.430286502)
//     (1745.0 9.29359319436 7.49506527791 303.453577565)
//     (1750.0 9.3093216827 7.48401839237 303.476868627)
//     (1755.0 9.32505017103 7.47297150683 303.50015969)
//     (1760.0 9.34077865936 7.46192462129 303.523450752)
//     (1765.0 9.35650714769 7.45087773575 303.546741815)
//     (1770.0 9.37223563603 7.43983085021 303.570032877)
//     (1775.0 9.38796412436 7.42878396467 303.59332394)
//     (1780.0 9.40369261269 7.41773707912 303.616615003)
//     (1785.0 9.41942110102 7.40669019358 303.639906065)
//     (1790.0 9.43514958936 7.39564330804 303.663197128)
//     (1795.0 9.45087807769 7.3845964225 303.68648819)
//     (1800.0 9.46660656602 7.37354953696 303.709779253)
//     (1805.0 9.48233505436 7.36250265142 303.733070315)
//     (1810.0 9.49806354269 7.35145576588 303.756361378)
//     (1815.0 9.51379203102 7.34040888034 303.77965244)
//     (1820.0 9.52952051935 7.3293619948 303.802943503)
//     (1825.0 9.54524900769 7.31831510926 303.826234565)
//     (1830.0 9.56097749602 7.30726822372 303.849525628)
//     (1835.0 9.57670598435 7.29622133818 303.87281669)
//     (1840.0 9.59243447268 7.28517445264 303.896107753)
//     (1845.0 9.60816296102 7.2741275671 303.919398815)
//     (1850.0 9.62389144935 7.26308068156 303.942689878)
//     (1855.0 9.63961993768 7.25203379602 303.96598094)
//     (1860.0 9.65432709188 7.2376578099 303.988680381)
//     (1865.0 9.66596304977 7.21327107309 304.009600791)
//     (1870.0 9.67759900765 7.18888433629 304.0305212)
//     (1875.0 9.68923496554 7.16449759948 304.051441609)
//     (1880.0 9.70087092342 7.14011086267 304.072362018)
//     (1885.0 9.71250688131 7.11572412587 304.093282427)
//     (1890.0 9.72414283919 7.09133738906 304.114202836)
//     (1895.0 9.73577879708 7.06695065226 304.135123245)
//     (1900.0 9.74741475497 7.04256391545 304.156043654)
//     (1905.0 9.75905071285 7.01817717864 304.176964064)
//     (1910.0 9.77068667074 6.99379044184 304.197884473)
//     (1915.0 9.78232262862 6.96940370503 304.218804882)
//     (1920.0 9.79395858651 6.94501696822 304.239725291)
//     (1925.0 9.8055945444 6.92063023142 304.2606457)
//     (1930.0 9.81723050228 6.89624349461 304.281566109)
//     (1935.0 9.82886646017 6.8718567578 304.302486518)
//     (1940.0 9.84050241805 6.847470021 304.323406928)
//     (1945.0 9.85213837594 6.82308328419 304.344327337)
//     (1950.0 9.86377433382 6.79869654738 304.365247746)
//     (1955.0 9.87541029171 6.77430981058 304.386168155)
//     (1960.0 9.8870462496 6.74992307377 304.407088564)
//     (1965.0 9.89868220748 6.72553633696 304.428008973)
//     (1970.0 9.91031816537 6.70114960016 304.448929382)
//     (1975.0 9.92195412325 6.67676286335 304.469849792)
//     (1980.0 9.93359008114 6.65237612654 304.490770201)
//     (1985.0 9.94522603903 6.62798938974 304.51169061)
//     (1990.0 9.95686199691 6.60360265293 304.532611019)
//     (1995.0 9.9684979548 6.57921591612 304.553531428)
//     (2000.0 9.98013391268 6.55482917932 304.574451837)
);

// Update internal field.
updateInternalFields      true;

// Update boundary field.
updateBoundaryFields      false;

// ************************************************************************* //
